In [3]:
import pandas as pd
import numpy as np

## Pandas Series

In [6]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [28]:
pd.Series(data = my_data, index = d.keys())

a    10
b    20
c    30
dtype: int64

In [30]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [32]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [34]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

## Pandas Data Frame

In [37]:
from numpy.random import randn

In [39]:
# Hold a consistent 

np.random.seed(101)

In [41]:
# Create a dataframe

df1 = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# Accessing the column 

df1['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
# Look at datatype

type(df1['X'])

pandas.core.series.Series

In [47]:
type(df1)

pandas.core.frame.DataFrame

In [53]:
# Accessing the multiple column

df1[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [59]:
# Adding the new column existing dataframe 

df1['P'] = randn(5)

In [67]:
df1

          W         X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826  0.390528
B  0.651118 -0.319318 -0.848077  0.605965  0.166905
C -2.018168  0.740122  0.528813 -0.589001  0.184502
D  0.188695 -0.758872 -0.933237  0.955057  0.807706
E  0.190794  1.978757  2.605967  0.683509  0.072960

In [71]:
# Remove the column temporary

df1.drop(columns = ['P'], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df1['new'] = df1['Y'] + df1['Z']
df1

          W         X         Y         Z         P       new
A  2.706850  0.628133  0.907969  0.503826  0.390528  1.411795
B  0.651118 -0.319318 -0.848077  0.605965  0.166905 -0.242112
C -2.018168  0.740122  0.528813 -0.589001  0.184502 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.807706  0.021819
E  0.190794  1.978757  2.605967  0.683509  0.072960  3.289476

In [77]:
# Remove the column permanently

df1.drop(columns = ['P'], axis =1, inplace = True)

In [79]:
df1

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [91]:
# Removing the rows of data frame

df1.drop('E', axis = 0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

In [99]:
# Accessing the dataframe rows base on location label

np.array(df1.loc['A'])

array([2.70684984, 0.62813271, 0.90796945, 0.50382575, 1.4117952 ])

In [101]:
# Acessing the dataframe rows base on location index

np.array(df1.iloc[2])

array([-2.01816824,  0.74012206,  0.52881349, -0.58900053, -0.06018704])

In [105]:
# Acessing the  one specific data

df1.loc['B', 'Z']

0.6059653494949336

In [107]:
# Acessing the multiple specific rows and columns

df1.loc[['A', 'B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [113]:
df1.iloc[[0, 1], [2, 3]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965